# Agenda, day 2

1. Q&A
2. Data frames -- creating and working with them
3. Adding and removing data in our data frames
4. Useful methods for data frames
5. Boolean / mask indexes and selecting data
6. using `.loc` for retrieving rows, rows/columns
7. Reading data from outside sources
    - CSV, Excel, etc.
  
Download this file, which contains a few items we'll use in the class: https://files.lerner.co.il/data-science-exercise-files.zip

In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [3]:
temps = Series([20, 23, 25, 22, 23], index=list('abcde'))
temps

a    20
b    23
c    25
d    22
e    23
dtype: int64

# Most of the time, we want 2D data!

It's pretty standard to have *tabular* data, which contains 2 dimensions, normally seen as rows and columns.

You want think of each column in a data frame (which is the Pandas 2D data structure) as a series. It will have an index for each element.  Those indexes are shared across all of the columns, and each column has its own name, as well.

In a data frame:

- The rows are labeled with an index
- The columns are labeled with columns (yeah, that's repetitive)

In [4]:
# To create a data frame:
# - we need 2D data -- this could be a list of lists, or a list of dicts, or a dict of lists
#   it could also be a 2D NumPy array
# - we need names for the rows (the index)
# - we need names for the columns

# something simple, using a list of lists

df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]])
df

     0    1    2
0   10   20   30
1   40   50   60
2   70   80   90
3  100  110  120

In [5]:
# let's add names for both our index (the rows) and our columns


df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]],
              index=list('abcd'),
              columns=list('xyz'))
df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [6]:
# if I want to retrieve a row, I can use .loc or .iloc, just like with
# a series!

df.loc['a']   # this retrieves row a

x    10
y    20
z    30
Name: a, dtype: int64

Pandas only knows how to handle data in a limited number of ways. If you ask for one value, you'll get that value. But if you ask for a number of values in 1D, you'll get a series. (That's what we got here.) If you ask for a number of values in 2D, you'll get a data frame.

In [7]:
df.loc['b']

x    40
y    50
z    60
Name: b, dtype: int64

In [8]:
df.loc['d']

x    100
y    110
z    120
Name: d, dtype: int64

In [10]:
%xmode Minimal
df.loc['x']

Exception reporting mode: Minimal

KeyError: 'x'

In [11]:
# how can I retrieve a single column?
# for this, we use just []! 
# this is why I asked you last week *NOT* to use just [] to get items from a series,
# but rather to use .loc and .iloc

df['x']  # this is a column, and we get it back!

a     10
b     40
c     70
d    100
Name: x, dtype: int64

In [12]:
# can I retrieve more than one row, or more than one column?
# remember, we can use "fancy indexing," passing a list of index/column names

df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [13]:
df.loc[['a', 'c']]  # fancy indexing

    x   y   z
a  10  20  30
c  70  80  90

In [15]:
df.loc['b':'d']   # slice -- only one pair of [] -- with .loc, the endpoint is included!

     x    y    z
b   40   50   60
c   70   80   90
d  100  110  120

In [16]:
# you can do similar things with .iloc, which uses the numeric position

df.iloc[1]

x    40
y    50
z    60
Name: b, dtype: int64

In [17]:
df.iloc[[1, 3]]

     x    y    z
b   40   50   60
d  100  110  120

In [19]:
df.iloc[1:3]  # this is up to and *not* including, as usual in Python

    x   y   z
b  40  50  60
c  70  80  90

In [20]:
# how can I retrieve multiple columns?
# answer: just use a list of column names, as you would with the index

df[['x', 'z']]

     x    z
a   10   30
b   40   60
c   70   90
d  100  120

In [21]:
df[['z', 'x']]   # retrieve them in a different order

     z    x
a   30   10
b   60   40
c   90   70
d  120  100

In [22]:
# sometimes, you might want a one-column data frame, rather than a series
# you could say

df['x']

a     10
b     40
c     70
d    100
Name: x, dtype: int64

In [23]:
# instead, you can say

df[['x']]   # the [[ ]] means: I want a data frame back, even though, just one column

     x
a   10
b   40
c   70
d  100

In [24]:
# once you have retrieved from a data frame, you can perform all sorts of calculations
# using methods -- min, mean, max, std, median, etc.

# Exercise: Grocery store

1. Create a data frame in which you have two columns. One is the price of an item (`price`), and the other will be the number of sales of that item (`sales`). The index will be the names of the items that you are selling.
2. The data frame should have 4 rows, and each item will have a price and a number of sales.
3. Retrieve all of the info for apples.
4. Retrieve all of the info for bananas.
5. Retrieve all information for apples and bananas.
6. What is the mean price for all products?
7. What is the mean price for just apples and bananas?

In [26]:
df = DataFrame([[10, 5],
                [15, 4],
                [7, 10],
                [20, 2]],
            index='apple banana cucumber dill'.split(),
             columns='price sales'.split())

df

          price  sales
apple        10      5
banana       15      4
cucumber      7     10
dill         20      2

In [27]:
# Retrieve all of the info for apples.

df.loc['apple']

price    10
sales     5
Name: apple, dtype: int64

In [28]:
# Retrieve all of the info for bananas.

df.loc['banana']

price    15
sales     4
Name: banana, dtype: int64

In [29]:
# Retrieve all information for apples and bananas.

df.loc[  ['apple', 'banana']   ]

        price  sales
apple      10      5
banana     15      4

In [30]:
# What is the mean price for all products?

df['price'].mean()

np.float64(13.0)

In [31]:
# What is the mean price for just apples and bananas?

df.loc[ ['apple', 'banana']]

        price  sales
apple      10      5
banana     15      4

In [33]:
df.loc[ ['apple', 'banana']] ['price'].mean()

np.float64(12.5)

In [35]:
# a better way, if we have both the rows we want and the column(s) we want,
# is to use the 2-argument version of df.loc:

(
df.loc[ 
    ['apple', 'banana'],  # row selector
    ['price']]            # column selector
    .mean()
)

price    12.5
dtype: float64

# Modifying our data frame

1. We can add a new column by assigning to it. (If the column name already exists, then we replace the old one.) Just make sure that the value we assign to it has the same number of elements as the data frame's index!
2. We can add a new row by assigning to `.loc`. Here, if the index already exists, we get a new row anyway, with the same (repeated) index.

In [37]:
supermarket_df = df
supermarket_df

          price  sales
apple        10      5
banana       15      4
cucumber      7     10
dill         20      2

In [38]:
df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]],
              index=list('abcd'),
              columns=list('xyz'))
df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [39]:
df['new_column'] = [2,4,6,8]

In [40]:
df

     x    y    z  new_column
a   10   20   30           2
b   40   50   60           4
c   70   80   90           6
d  100  110  120           8

In [41]:
df['new_column'] = [1,2,3,4]

In [42]:
df

     x    y    z  new_column
a   10   20   30           1
b   40   50   60           2
c   70   80   90           3
d  100  110  120           4

In [43]:
df['w'] = [1,2,3]

ValueError: Length of values (3) does not match length of index (4)

In [44]:
# we can calculate based on existing series,
# and then assign the result to a new series!

df['x'] + df['y']

a     30
b     90
c    150
d    210
dtype: int64

In [45]:
df['x_and_y'] = df['x'] + df['y']

In [46]:
df

     x    y    z  new_column  x_and_y
a   10   20   30           1       30
b   40   50   60           2       90
c   70   80   90           3      150
d  100  110  120           4      210

In [47]:
# what happens if I want to add a new row?

df.loc['e'] = [200, 300, 400, 500, 600]

df

     x    y    z  new_column  x_and_y
a   10   20   30           1       30
b   40   50   60           2       90
c   70   80   90           3      150
d  100  110  120           4      210
e  200  300  400         500      600

# Exercise: More groceries!

1. Define a new column, `revenue`, for the groceries, which will be `price` * `sales`. What is the mean of the `revenue` column?
2. Define a new column, `sales_tax`, in which you calculate 10% of the revenue.
3. Define a new column, `net`, which is `revenue` - `sales_tax`

In [48]:
supermarket_df

          price  sales
apple        10      5
banana       15      4
cucumber      7     10
dill         20      2

In [49]:
supermarket_df['price'] * supermarket_df['sales']

apple       50
banana      60
cucumber    70
dill        40
dtype: int64

In [51]:
supermarket_df['revenue'] = supermarket_df['price'] * supermarket_df['sales']
supermarket_df

          price  sales  revenue
apple        10      5       50
banana       15      4       60
cucumber      7     10       70
dill         20      2       40

In [52]:
supermarket_df['sales_tax'] = supermarket_df['revenue'] * 0.1
supermarket_df

          price  sales  revenue  sales_tax
apple        10      5       50        5.0
banana       15      4       60        6.0
cucumber      7     10       70        7.0
dill         20      2       40        4.0

In [53]:
supermarket_df['revenue'] - supermarket_df['sales_tax']

apple       45.0
banana      54.0
cucumber    63.0
dill        36.0
dtype: float64

In [55]:
supermarket_df['net'] = supermarket_df['revenue'] * 0.9
supermarket_df

          price  sales  revenue  sales_tax   net
apple        10      5       50        5.0  45.0
banana       15      4       60        6.0  54.0
cucumber      7     10       70        7.0  63.0
dill         20      2       40        4.0  36.0

# Alternative syntax for columns: dot syntax

Instead of saying `df[colname]` to get a column, you can say `df.colname`, with a `.`!

The good news:
- Shorter

The bad news:
- You might get confused about column names vs. methods vs. other attributes on a data frame
- If you have a column with the same name as a Pandas method, bad news!
- If you have a column with spaces or other special characters, that's not allowed with dot syntax
- It makes (I believe) for more confusing code, because it's less obvious which are the methods and which are the columns

In [57]:
supermarket_df.revenue

apple       50
banana      60
cucumber    70
dill        40
Name: revenue, dtype: int64

# Next up

1. Useful methods (data frame versions of many you know, and some new ones)
2. Boolean/mask indexes and our data frames

# Rule of thumb #1

Anywhere you can pass a single string (for an index, or a column name), you can pass a list of strings (for more than one index, or more than one column name).

# Rule of thumb #2

Anything you can do to a series, you can do to a data frame:

- If the series version of a method returns a single (scalar) value, then the data frame version of the same method will return a series.
- If the series version of a method returns a series, then the data frame version of the same method will return a data frame.

In [58]:
s = Series([10, 20, 30, 40, 50, 60, 70, 80],
          index=list('abcdefgh'))

# I'll use a dict of lists; each key is a column name, and each value
# is a list, the values for that column

df = DataFrame({'numbers': [10, 20, 30, 40, 50, 60, 70,  80],
               'times_10': [100, 200, 300, 400, 500, 600, 700, 800]},
              index=list('abcdefgh'))

s

a    10
b    20
c    30
d    40
e    50
f    60
g    70
h    80
dtype: int64

In [59]:
df

   numbers  times_10
a       10       100
b       20       200
c       30       300
d       40       400
e       50       500
f       60       600
g       70       700
h       80       800

In [60]:
# what's the mean of s?

s.mean()   # this returns a single (scalar) value

np.float64(45.0)

In [62]:
# what's the mean of df?
# by our rule #2, we'll get a result for each column
# if you run a method on a data frame, you get one result per column

df.mean()  # this will return a series

numbers      45.0
times_10    450.0
dtype: float64

In [63]:
s.min()

np.int64(10)

In [64]:
s.max()

np.int64(80)

In [65]:
df.min()

numbers      10
times_10    100
dtype: int64

In [66]:
df.max()

numbers      80
times_10    800
dtype: int64

In [67]:
# I can, instead, just run s.describe() to get all of the 
# descriptive statistics for my series

s.describe()   # describe returns a series for our series

count     8.000000
mean     45.000000
std      24.494897
min      10.000000
25%      27.500000
50%      45.000000
75%      62.500000
max      80.000000
dtype: float64

In [68]:
df.describe()  # describe will give us a series of descriptions for each column

         numbers    times_10
count   8.000000    8.000000
mean   45.000000  450.000000
std    24.494897  244.948974
min    10.000000  100.000000
25%    27.500000  275.000000
50%    45.000000  450.000000
75%    62.500000  625.000000
max    80.000000  800.000000

In [69]:
# get the first 5 values from our series

s.head()

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [70]:
s.head(5)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [71]:
s.tail()

d    40
e    50
f    60
g    70
h    80
dtype: int64

In [72]:
s.tail(5)

d    40
e    50
f    60
g    70
h    80
dtype: int64

In [73]:
# head/tail give us a series from a series
# head/tail will give us a data frame from a data frame

df.head()

   numbers  times_10
a       10       100
b       20       200
c       30       300
d       40       400
e       50       500

In [74]:
df.tail()

   numbers  times_10
d       40       400
e       50       500
f       60       600
g       70       700
h       80       800

In [75]:
import numpy as np

s = Series([10, 20, np.nan, 40, 50, np.nan, 70, 80],
          index=list('abcdefgh'))

# I'll use a dict of lists; each key is a column name, and each value
# is a list, the values for that column

df = DataFrame({'numbers': [10, 20, np.nan, 40, 50, np.nan, 70,  80],
               'times_10': [100, 200, 300, np.nan, 500, 600, 700, np.nan]},
              index=list('abcdefgh'))

s

a    10.0
b    20.0
c     NaN
d    40.0
e    50.0
f     NaN
g    70.0
h    80.0
dtype: float64

In [77]:
df

   numbers  times_10
a     10.0     100.0
b     20.0     200.0
c      NaN     300.0
d     40.0       NaN
e     50.0     500.0
f      NaN     600.0
g     70.0     700.0
h     80.0       NaN

In [78]:
# how can I deal with NaN?
# option 1: delete it!

s.dropna()  # this returns a new series, without the NaN values

a    10.0
b    20.0
d    40.0
e    50.0
g    70.0
h    80.0
dtype: float64

In [88]:
df.dropna() # this returns a new data frame, without any ROW containing NaN

   numbers  times_10
a     10.0     100.0
b     20.0     200.0
e     50.0     500.0
g     70.0     700.0

In [80]:
df

   numbers  times_10
a     10.0     100.0
b     20.0     200.0
c      NaN     300.0
d     40.0       NaN
e     50.0     500.0
f      NaN     600.0
g     70.0     700.0
h     80.0       NaN

In [81]:
# what if you only care about NaN values in numbers, but they're OK in times_10?
# you can specify the "subset" keyword argument, indicating that where to look
# for NaN values

df.dropna(subset='numbers')

   numbers  times_10
a     10.0     100.0
b     20.0     200.0
d     40.0       NaN
e     50.0     500.0
g     70.0     700.0
h     80.0       NaN

In [82]:
df.dropna(subset=['numbers', 'times_10'])

   numbers  times_10
a     10.0     100.0
b     20.0     200.0
e     50.0     500.0
g     70.0     700.0

In [83]:
# fillna -- similar!
s.fillna(999)   # this returns a new series in which NaN is replaced by 999

a     10.0
b     20.0
c    999.0
d     40.0
e     50.0
f    999.0
g     70.0
h     80.0
dtype: float64

In [84]:
df.fillna(999)  # yes, this will work!

   numbers  times_10
a     10.0     100.0
b     20.0     200.0
c    999.0     300.0
d     40.0     999.0
e     50.0     500.0
f    999.0     600.0
g     70.0     700.0
h     80.0     999.0

In [85]:
# another approach: let's replace NaN with the mean
s.fillna(s.mean())  # calculate s.mean(), and use it to replace NaN

a    10.0
b    20.0
c    45.0
d    40.0
e    50.0
f    45.0
g    70.0
h    80.0
dtype: float64

In [86]:
df.mean()

numbers      45.0
times_10    400.0
dtype: float64

In [87]:
df.fillna(df.mean()) # this uses the numbers mean to fill numbers, and the
                     # times_10 mean to fill times_10

   numbers  times_10
a     10.0     100.0
b     20.0     200.0
c     45.0     300.0
d     40.0     400.0
e     50.0     500.0
f     45.0     600.0
g     70.0     700.0
h     80.0     400.0

# dtypes are per column, aka per series

We know that the dtype indicates what single type all values in a series must have.
In a data frame, I've already told you that each column is a series. But let's prove it.

The "dtypes" attribute returns the dtype for each column!

In [90]:
df.dtypes

numbers     float64
times_10    float64
dtype: object

In [91]:
df['also_numbers'] = range(8)

In [92]:
df

   numbers  times_10  also_numbers
a     10.0     100.0             0
b     20.0     200.0             1
c      NaN     300.0             2
d     40.0       NaN             3
e     50.0     500.0             4
f      NaN     600.0             5
g     70.0     700.0             6
h     80.0       NaN             7

In [93]:
df.dtypes

numbers         float64
times_10        float64
also_numbers      int64
dtype: object

In [97]:
# what if I want to fillna with a different value for each column?
# not a different computed value, but a different "static" value?

# in df, I want to replace NaN in numbers with 999 and in times_10 with 9990.
# we can pass a dictionary!

df.fillna({'numbers':999, 'times_10':9990})

   numbers  times_10  also_numbers
a     10.0     100.0             0
b     20.0     200.0             1
c    999.0     300.0             2
d     40.0    9990.0             3
e     50.0     500.0             4
f    999.0     600.0             5
g     70.0     700.0             6
h     80.0    9990.0             7

# Exercise: Temperatures

1. Define a data frame with the 10-day forecast for low and high temperatures in your city. (There should be 10 rows and 2 columns. )When entering the data, replace some of the values with `np.nan`.
2. Replace all `NaN` values with a single value.
3. Replace `NaN` values in `highs` and `lows` with different static values.
4. Replace `NaN` values in each column with that column's mean.

In [99]:
# once again, I'll use a dict of lists
df = DataFrame({'highs':[10, np.nan, 12, 15, np.nan, 15, 18, 19],
               'lows': [8, 6, np.nan, 11, 10, np.nan, 8, 8]},
              index='1902 2002 2102 2202 2302 2402 2502 2602'.split())
df

      highs  lows
1902   10.0   8.0
2002    NaN   6.0
2102   12.0   NaN
2202   15.0  11.0
2302    NaN  10.0
2402   15.0   NaN
2502   18.0   8.0
2602   19.0   8.0

In [100]:
df.fillna(12)  # this returns a new data frame, based on df, with all nans turned to 12

      highs  lows
1902   10.0   8.0
2002   12.0   6.0
2102   12.0  12.0
2202   15.0  11.0
2302   12.0  10.0
2402   15.0  12.0
2502   18.0   8.0
2602   19.0   8.0

In [101]:
# Replace NaN values in highs and lows with different static values.

df.fillna({'highs':15, 'lows':12})

      highs  lows
1902   10.0   8.0
2002   15.0   6.0
2102   12.0  12.0
2202   15.0  11.0
2302   15.0  10.0
2402   15.0  12.0
2502   18.0   8.0
2602   19.0   8.0

In [102]:
# Replace NaN values in each column with that column's mean.

df.fillna(df.mean())

          highs  lows
1902  10.000000   8.0
2002  14.833333   6.0
2102  12.000000   8.5
2202  15.000000  11.0
2302  14.833333  10.0
2402  15.000000   8.5
2502  18.000000   8.0
2602  19.000000   8.0

In [103]:
# isn't there any other way to replace nan values?
# yes, and it's even better: interpolation!

# the idea behind interpolation is:
# - if you have a NaN with two numbers around it, just replace NaN with their mean
# - if you have two NaNs with numbers around them, then replace them in step fashion
#   so if you have 10, nan, nan, 19, then they would be 10, 13, 16, 19

df.interpolate()

      highs  lows
1902   10.0   8.0
2002   11.0   6.0
2102   12.0   8.5
2202   15.0  11.0
2302   15.0  10.0
2402   15.0   9.0
2502   18.0   8.0
2602   19.0   8.0

Interpolation is *great*. But it's only appropriate in some data sets. Temperatures, or even stock prices, can be done this way. You know that the value is wrong, but it's less wrong than any other guess you'll make.  But if you interpolate a stock price during a flash crash, then you'll be *very* wrong.

# Boolean indexes!

We saw last week that we can use a boolean series as a "mask index," to keep only selected values in our series. This means that we can perform a comparison, get a boolean series back, and then apply that back to the series with `.loc`, keeping only those that are `True`.

In [104]:
s

a    10.0
b    20.0
c     NaN
d    40.0
e    50.0
f     NaN
g    70.0
h    80.0
dtype: float64

In [107]:
# I first calculate s<60, giving me a boolean series
# I apply that to s.loc in []
# I keep only the values where that boolean series had True
s.loc[s < 60]

a    10.0
b    20.0
d    40.0
e    50.0
dtype: float64

In [110]:
# can I do that with a data frame?
# of course!

# one possibility: apply a boolean series to the entire data frame

df.loc[ df['highs'] < 15 ]    # keep only those rows where df['highs'] < 15

      highs  lows
1902   10.0   8.0
2102   12.0   NaN

In [111]:
df.loc[ df['highs'] < df['lows'] ]

Empty DataFrame
Columns: [highs, lows]
Index: []

In [113]:
df.loc[ df['highs'] - df['lows'] >= 10 ]

      highs  lows
2502   18.0   8.0
2602   19.0   8.0

When we use `df.loc` on the *entire* data frame with a boolean series, we get back all of those *rows* for which this is true.

# Temp comparisons

1. Find all of the days on which the high temperature will be 50% higher than the low.
2. Find all of the days on which the high and low temperature will be within 5 degrees of one another.

In [115]:
df

      highs  lows
1902   10.0   8.0
2002    NaN   6.0
2102   12.0   NaN
2202   15.0  11.0
2302    NaN  10.0
2402   15.0   NaN
2502   18.0   8.0
2602   19.0   8.0

In [119]:
df.loc[  df['highs'] >= df['lows'] * 1.5  ]

      highs  lows
2502   18.0   8.0
2602   19.0   8.0

In [122]:
df.loc[  (df['highs'] - df['lows']) <= 5  ]

      highs  lows
1902   10.0   8.0
2202   15.0  11.0

# Next up

1. Using `.loc` in more sophisticated ways
2. Reading data from CSV and other sources

Download, if you haven't already, the zipfile of CSV files from https://files.lerner.co.il/data-science-exercise-files.zip

In [125]:
df

      highs  lows
1902   10.0   8.0
2002    NaN   6.0
2102   12.0   NaN
2202   15.0  11.0
2302    NaN  10.0
2402   15.0   NaN
2502   18.0   8.0
2602   19.0   8.0

In [126]:
# I want the low temperature on Feb 21st

df.loc['2102']

highs    12.0
lows      NaN
Name: 2102, dtype: float64

In [128]:
# unfortunately, this works!

df.loc['2102'].loc['lows']

np.float64(nan)

In [129]:
# it's much better to pass *two* arguments to df.loc,
# the row selector and the column selector.

# each of these -- the row selector and column selector - can have
# a variety of syntaxes and contents. But the goal is the same,
# to tell Pandas which rows and which columns you want.

df.loc[
    '2102',  # row selector -- one string, so one row
    'lows'   # column selector - -one string, so one column
    ]

np.float64(nan)

In [132]:

df.loc[
    ['2102', '2502'],  # row selector -- list of strings, so more than one row
    'lows'             # column selector - -one string, so one column
    ]

2102    NaN
2502    8.0
Name: lows, dtype: float64

In [133]:

df.loc[
    '2102',            # row selector -- one string, so one row
    ['highs','lows']   # column selector -- a list of strings, so multiple columns
    ]

highs    12.0
lows      NaN
Name: 2102, dtype: float64

In [134]:
# what if I have both being lists of strings?


df.loc[
    ['2102', '2502'],  # row selector -- list of strings, so more than one row
    ['highs','lows']   # column selector -- a list of strings, so multiple columns
    ]

      highs  lows
2102   12.0   NaN
2502   18.0   8.0

In [135]:
# we've already seen that we can use a boolean series to select
# that boolean series (i.e., that mask index) can be used as our row select
# (it can be used as a column selector, but that's weird)


df.loc[
    df['highs'] > 10,   # row selector -- a boolean series
    'highs' # column selector, with one column
    ]

2102    12.0
2202    15.0
2402    15.0
2502    18.0
2602    19.0
Name: highs, dtype: float64

In [136]:

df.loc[
    '2102':'2502'  # row selector, as a slice
    'highs' # column selector, with one column
    ]

      highs  lows
2102   12.0   NaN
2202   15.0  11.0
2302    NaN  10.0
2402   15.0   NaN
2502   18.0   8.0

# Exercise: Using `.loc`

1. Retrieve all rows from the high-low temp data frame where the high temp is within 5 degrees of the low temp, and show only the low-temp columns.
2. Retrieve all rows where the low is greater than the mean, and show the high-temp column only.
3.

In [138]:
df = df.interpolate()
df

      highs  lows
1902   10.0   8.0
2002   11.0   6.0
2102   12.0   8.5
2202   15.0  11.0
2302   15.0  10.0
2402   15.0   9.0
2502   18.0   8.0
2602   19.0   8.0

In [140]:
# Retrieve all rows from the high-low temp data frame where the high temp is within 5 degrees 
# of the low temp, and show only the low-temp columns.

df.loc[
    df['highs'] - df['lows'] <= 5,   # row selector
    'lows'    # column selector
]

1902     8.0
2002     6.0
2102     8.5
2202    11.0
2302    10.0
Name: lows, dtype: float64

In [141]:

df.loc[
    df['highs'] - df['lows'] <= 5,   # row selector
    ['lows']    # column selector
]

      lows
1902   8.0
2002   6.0
2102   8.5
2202  11.0
2302  10.0

In [144]:
# Retrieve all rows where the low is greater than the mean, and show 
# the high-temp column only.

df.loc[
    df['lows'] > df['lows'].mean(),   # row selector
    'highs'
    ]

2202    15.0
2302    15.0
2402    15.0
Name: highs, dtype: float64

In [146]:
# new new new in Pandas 3.0

df.loc[
    pd.col('lows') > pd.col('lows').mean(),   # row selector
    'highs'
    ]

2202    15.0
2302    15.0
2402    15.0
Name: highs, dtype: float64

# Getting data from the outside world

So far, we have either used nonsense data or we have entered it ourselves, manually. Neither is realistic or reflects the actual way we use data.

Normally, we'll load it in from an external source:

- A file on disk
- A file on the network
- A database

Very commonly, we use files, and those files can be read into Pandas, and thus into a data frame. 

What format are these files in? The most common formats are CSV (comma-separated values) and Excel. Both of these formats have big problems, and force us to resolve ambiguities.\

There is finally a good, portable, binary, and small format, known as parquet, thanks to the Apache Arrow open-source project. 

To create a data frame from a file, we will use the `pd.read_*` functions, and specifically `pd.read_csv` to read from a CSV into a data frame.

Note: This is not a `df` method, but a `pd` method (or function). That's because we're building a new data frame, not running something on an existing one.

`pd.read_csv(filename)` returns a new data frame

CSV is a very very very loose standard. Yes, every line has one record. Yes, records are separated. But beyond that, there is a lot of flexibility:

- What separator do we use between fields? By default, commas, but tabs and colons and others are also common.
- Does the first line show the column names? Maybe...maybe not.
- Are there junk lines before the column names?

When you invoke `read_csv`, if you're lucky, then the file will load up just fine. Pandas will assign one of three dtypes to every column:

- `int64` if it contains only integers
- `float64` if it contains integers + a decimal point
- `object` or `str`, for strings, if it cannot figure out what to use

In [147]:
# I have a file with 10k taxi rides from 2016
# here's what the file looks like (the first few lines)

# Jupyter lets you run Unix commands if you're on a Mac/Linux
# you use ! at the start of the line, then the rest is a Unix command
!head taxi.csv

VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954429626464844,40.764141082763672,1,N,-73.974754333496094,40.754093170166016,2,17,0,0.5,0,0,0.3,17.8
2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,.46,-73.971443176269531,40.758941650390625,1,N,-73.978538513183594,40.761909484863281,1,6.5,0,0.5,1,0,0.3,8.3
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,.87,-73.978111267089844,40.738433837890625,1,N,-73.990272521972656,40.745437622070313,1,8,0,0.5,2.2,0,0.3,11
2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892333984375,40.773529052734375,1,N,-73.971527099609375,40.760330200195312,1,13.5,0,0.5,2.86,0,0.3,17.16
1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979087829589844,40.776771545410156,1,N,-73.982162475585937,40.758998870849609,2,9.5,0,0.5,0,0,0.3,10.3
1,2015-06-02 11:19:33,2015-06-02 11:28:48,1,1.40,-73.94464111328125,40.779464721679688,1,N,-73.96136474609375,40.771560668945313,1,8,0,0.5,1.75,0,0.3,10.55
1,2015-06-02 11:19:34,2015-06-02 11:38:46,1,1.80,-73.992866516113281,40.748210906982422,1,N,-73.969772338867187,40.748458862304687,1,12.5,0,0.5,3,0,0.3,16.3
1,2015-06-02 11:19:35,2015-06-02 12:36:46,4,11.90,-73.863075256347656,40.769252777099609,1,N,-73.986709594726563,40.761306762695313,1,52.5,0,0.5,15,5.54,0.3,73.84
2,2015-06-02 11:19:36,2015-06-02 11:45:19,1,1.27,-73.991432189941406,40.749305725097656,1,N,-73.985061645507813,40.759525299072266,2,15,0,0.5,0,0,0.3,15.8

In [148]:
df = pd.read_csv('taxi.csv')

df

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9994,1,2015-06-01 00:12:59,2015-06-01 00:24:18,1,2.70,-73.947792,40.814972,1,N,-73.973358,40.783638,2,11.0,0.5,0.5,0.00,0.0,0.3,12.30
9995,1,2015-06-01 00:12:59,2015-06-01 00:28:16,1,4.50,-74.004066,40.747818,1,N,-73.953758,40.779285,1,16.0,0.5,0.5,3.00,0.0,0.3,20.30
9996,2,2015-06-01 00:13:00,2015-06-01 00:37:25,1,5.59,-73.994377,40.766102,1,N,-73.903206,40.750546,2,21.0,0.5,0.5,0.00,0.0,0.3,22.30
9997,2,2015-06-01 00:13:02,2015-06-01 00:19:10,6,1.54,-73.978302,40.748531,1,N,-73.989166,40.762852,2,6.5,0.5,0.5,0.00,0.0,0.3,7.80
9998,1,2015-06-01 00:13:04,2015-06-01 00:36:33,1,5.80,-73.983215,40.726414,1,N,-73.924133,40.701645,1,21.0,0.5,0.5,4.45,0.0,0.3,26.75

In [149]:
df.dtypes

VendorID                   int64
tpep_pickup_datetime         str
tpep_dropoff_datetime        str
passenger_count            int64
trip_distance            float64
pickup_longitude         float64
pickup_latitude          float64
RateCodeID                 int64
store_and_fwd_flag           str
dropoff_longitude        float64
dropoff_latitude         float64
payment_type               int64
fare_amount              float64
extra                    float64
mta_tax                  float64
tip_amount               float64
tolls_amount             float64
improvement_surcharge    float64
total_amount             float64
dtype: object

# Exercise: Taxi queries

1. Download the zipfiles I told you about, and make sure that you know where `taxi.csv` is located on your computer. (If you put it in the same directory as you're running Jupyter, it's a bit easier.)
2. Use `pd.read_csv` to load `taxi.csv` into a data frame.
3. Find the mean `trip_distance`.
4. Were there any trips with a 0 distance. If so, how much did people pay, on average?
5. Were there any trips with <= `total_amount`? If so, how many passengers were on such trips, and how far did they go?